Tekla Open API Reference for Tekla Structures 2025
RebarPropertiesNullable.BendingRadius Property
 Gets or sets the bending radius radius of the reinforcement.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double? BendingRadius { get; set; }
Public Property BendingRadius As Double?
	Get
	Set
Property Value
Type: Nullable<Double>
See Also
Reference
RebarPropertiesNullable Class
Tekla.Structures.Model Namespace